{
  "backend/main.mo": "Empty Motoko actor serving as the backend canister entry point.",
  "feature_evidence.json": "Feature evidence report documenting two features: generating a custom clutch plate logo and updating the Header component to display it.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing the single-page automotive repair business website with sections for hero, services, location, contact, and footer.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color variables defining a warm automotive theme with amber/orange primary colors for light and dark modes.",
  "frontend/index.html": "HTML entry point with meta tags, title, and root div for the Maa Tara Clutch Plate Repairing Center website.",
  "frontend/src/App.tsx": "Main React component orchestrating the single-page layout with Header, Hero, Services, Location, Contact sections and Footer.",
  "frontend/src/components/ContactSection.tsx": "Contact section displaying phone number, email, and business hours in three card components with icons and hover effects.",
  "frontend/src/components/Footer.tsx": "Footer component with business summary, quick info list, copyright notice, and caffeine.ai attribution link with UTM tracking.",
  "frontend/src/components/Header.tsx": "Sticky header displaying the clutch plate logo image and business name with tagline in a gradient background.",
  "frontend/src/components/HeroSection.tsx": "Hero section with headline, service highlights for trucks/buses/cars, hero banner image with error handling, and decorative badge.",
  "frontend/src/components/LocationSection.tsx": "Location section with embedded Google Maps iframe and external link button for directions to the shop.",
  "frontend/src/components/ServicesSection.tsx": "Services grid displaying four service cards (truck, bus, car repair, and leather replacement) with icons, descriptions, and fallback SVG icons on image load errors.",
  "frontend/src/hooks/useActor.ts": "React hook managing ICP backend actor creation with authentication support, using React Query for caching and automatic query invalidation on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Custom React hook and provider for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with AuthClient integration.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm automotive-themed color palette for both light and dark modes using OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the theme with custom colors mapped to CSS variables, container settings, border radius utilities, animations, and typography plugins.",
  "project_state.json": "Project metadata tracking the clutch repair shop website build, including known deployment issues (inaccessible URL, email display problem), completed features, and image requirements."
}